my_str = ''

"""
1) У вас есть переменная my_str, тип - str. И переменная my_symbol, тип - str. 
Напечатать столько раз my_symbol, сколько он встречается в my_str. 
Пример:  my_str="blablacar", my_symbol="bla". 
Вывод на экран:
bla
bla
"""


"""
2) У вас есть переменная my_str, тип - str. И переменная my_symbol, тип - str. 
Напечатать ЧИСЛО сколько раз my_symbol встречается в my_str. 
Пример:  my_str="blablacar", my_symbol="bla". 
Вывод на экран:
2
"""

"""
3) У вас есть переменная my_str, тип - str. Напечатать ЧИСЛО сколько РАЗНЫХ символов встречается в my_str. 
Большая и маленькая буква считается как один символ. Пробелы, запятые и т.д. считаем тоже как символы.
Пример:  my_str="bla BLA car". 
Вывод на экран:
6
"""


"""
4)
Дана строка my_str и пустой список my_list.
Заполнить my_list символами из my_str, которые стоят на четных местах в строке
"""

my_str = "qwerty"
# решение через приведение типов

# решение через цикл


"""
5)
Дана строка my_str, список str_index целых чисел в диапазоне от 0 до длинны строки, пустой список my_list.
Заполнить my_list символами из my_str, которые стоят на местах с индексами из str_index
"""
my_list = []
my_str = "qwerty"
str_index = [0, 5, 3, 3, 4]


"""
6)
Даны списки my_list_1 и my_list_2.
Создать список my_result в который поместить элементы из my_list_1 и my_list_2 через один.
a) кол-во эл-тов одинаковое
б) кол-во эл-тов разное
"""
my_list_1 = [10, 20, 30, 40, 50]
my_list_2 = [3, 4, 5, 6, 7]
my_result = []


"""

7)
Даны списки my_list_1 и my_list_2.
Создать список my_result в который вначале поместить четные элементы из my_list_1, 
а потом все нечетные элементы из my_list_2.
"""

"""
8)
Дано целое число. Определить сколько цифр в этом числе.
"""
number = 746527310

"""
9)
Дано целое число. Определить наибольшую цифру в этом числе.
"""
number = 746527310


"""
10)
Дано целое число. Составить число с цифрами в обратном порядке.
"""
number = 746527310


"""
11)
Дано целое число. Составить число с цифрами в порядке возрастания.
"""
number = 746527310


# сортировка списка
my_list = [3, 5, -6]


# сортировка копии списка
new_list = sorted(my_list)

# ключ сортировки, порядок списка

"""
Цикл с условием( while)
Игра с угадыванием числа.

"""